# -*- coding: UTF-8 -*-
import pandas as pd


# # 提供的数据DAY_BLACKBACK
# data = {
#     "Token":  ["NODTA", "CURSR", "CHBLK", "CHGRD", "CHGRF", "CHRED", "CHGRN", "CHYLW", "CHMGD", "CHMGF",
#           "CHBRN", "CHWHT", "SCLBR", "CHCOR", "LITRD", "LITGN", "LITYW", "ISDNG", "DNGHL", "TRFCD",
#           "TRFCF", "LANDA", "LANDF", "CSTLN", "SNDG1", "SNDG2", "DEPSC", "DEPCN", "DEPDW", "DEPMD",
#           "DEPMS", "DEPVS", "DEPIT", "RADHI", "RADLO", "ARPAT", "NINFO", "RESBL", "ADINF", "RESGR",
#           "SHIPS", "PSTRK", "SYTRK", "PLRTE", "APLRT", "UINFD", "UINFF", "UIBCK", "UIAFD", "UINFR",
#           "UINFG", "UINFO", "UINFB", "UINFM", "UIBDR", "UIAFF", "OUTLW", "OUTLL", "RES01", "RES02",
#           "RES03", "RES04", "RES05"],
#     "Colour" : ["grey", "orange", "black", "grey", "grey", "red", "green", "yellow", "magenta", "magenta",
#                "brown", "white", "orange", "orange", "red", "green", "yellow", "magenta", "red", "magenta",
#                "magenta", "brown", "brown", "grey", "grey", "black", "grey", "grey", "white", "pale_blue",
#                "light_blue", "medium_blue", "yellow-green", "green", "green", "blue-green", "orange", "blue",
#                "yellow", "grey", "black", "black", "grey", "red", "orange", "black", "grey", "white",
#                "medium_blue", "red", "green", "orange", "blue", "magenta", "grey", "brown", "black",
#                "brown", "grey", "grey", "grey", "grey", "grey"],
#     "X": [0.2800, 0.3900, 0.2800, 0.2800, 0.2800, 0.4800, 0.3000, 0.4700, 0.3000, 0.2800, 0.4500,
#             0.2800, 0.3900, 0.3900, 0.4800, 0.3000, 0.4700, 0.3000, 0.4800, 0.3000, 0.2800, 0.4000,
#             0.4500, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2700, 0.2400, 0.2200, 0.2800,
#             0.3000, 0.3000, 0.2600, 0.3900, 0.1800, 0.4700, 0.2800, 0.2800, 0.2800, 0.2800, 0.5800,
#             0.3900, 0.2800, 0.2800, 0.2800, 0.2200, 0.4800, 0.3000, 0.3900, 0.1800, 0.3000, 0.2800,
#             0.4000, 0.2800, 0.3600, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800],
#     "Y": [0.3100, 28.000, 0.3100, 0.3100, 0.3100, 0.3000, 0.5200, 70.000, 0.1700, 0.2400,
#             30.000, 0.3100, 28.000, 28.000, 0.3000, 0.5200, 70.000, 0.1700, 0.3000, 0.1700,
#             0.2400, 49.000, 15.000, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3000,
#             0.2600, 0.2400, 0.3600, 0.5200, 0.5200, 0.4200, 28.000, 0.1500, 35.000, 0.3100,
#             0.3100, 0.3100, 0.3100, 0.3500, 28.000, 0.3100, 0.3100, 0.3100, 0.2400, 0.3000,
#             0.5200, 28.000, 0.1500, 0.1700, 0.3100, 49.000, 0.3100, 49.000, 0.3100, 0.3100,
#             0.3100, 0.3100, 0.3100],
#     "LUMINANCE": [25.000, 28.000, 45.000, 45.000, 25.000, 25.000, 60.000, 70.000, 53.000, 20.000, 25.000, 80.000, 28.000, 28.000, 25.000, 60.000, 70.000, 53.000, 25.000, 25.000, 20.000, 20.000, 45.000, 30.000, 80.000, 45.000, 0.000, 2.000, 8.000, 14.000, 14.000, 60.000, 20.000, 50.000, 28.000, 22.000, 35.000, 25.000, 80.000, 80.000, 30.000, 18.000, 28.000, 80.000, 30.000, 0.000, 14.000, 25.000, 60.000, 28.000, 25.000, 80.000, 30.000, 0.000, 20.000, 45.000, 20.000, 0.000, 20.000, 25.000, 25.000, 25.000,25.000,25.000]
# }





#DAY_WHITEBACK
data = {
    "Token": ["NODTA", "CURSR", "CHBLK", "CHGRD", "CHGRF", "CHRED", "CHGRN", "CHYLW",
              "CHMGD", "CHMGF", "CHBRN", "CHWHT", "SCLBR", "CHCOR", "LITRD", "LITGN",
              "LITYW", "ISDNG", "DNGHL", "TRFCD", "TRFCF", "LANDA", "LANDF", "CSTLN",
              "SNDG1", "SNDG2", "DEPSC", "DEPCN", "DEPDW", "DEPMD", "DEPMS", "DEPVS",
              "DEPIT", "RADHI", "RADLO", "ARPAT", "NINFO", "RESBL", "ADINF", "RESGR",
              "SHIPS", "PSTRK", "SYTRK", "PLRTE", "APLRT", "UINFD", "UINFF", "UIBCK",
              "UIAFD", "UINFR", "UINFG", "UINFO", "UINFB", "UINFM", "UIBDR", "UIAFF",
              "OUTLW", "OUTLL", "RES01", "RES02", "RES03", "RES04", "RES05"],
    "Colour": ["grey", "orange", "black", "grey", "grey", "red", "green", "yellow",
               "magenta", "magenta", "brown", "white", "orange", "orange", "red", "green",
               "yellow", "magenta", "red", "magenta", "magenta", "brown", "brown", "grey",
               "grey", "black", "grey", "grey", "white", "pale_blue", "light_blue",
               "medium_blue", "yellow-green", "green", "green", "blue-green", "orange",
               "blue", "yellow", "grey", "black", "black", "grey", "red", "orange", "black",
               "grey", "white", "medium_blue", "red", "green", "orange", "blue", "magenta",
               "grey", "brown", "black", "brown", "grey", "grey", "grey", "grey", "grey",
               "medium_blue", "red", "green", "orange", "blue", "magenta", "grey", "brown",
               "black", "brown", "grey", "grey", "grey", "grey", "grey"],
    "X": [0.2800, 0.5200, 0.2800, 0.2800, 0.2800, 0.4800, 0.3000, 0.4100, 0.3000, 0.2800,
          0.4200, 0.2800, 0.5200, 0.5200, 0.4800, 0.3000, 0.4100, 0.3000, 0.4800, 0.3000,
          0.2800, 0.3600, 0.4500, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2700,
          0.2400, 0.2200, 0.2800, 0.3000, 0.3000, 0.2600, 0.3900, 0.1800, 0.4100, 0.2800,
          0.2800, 0.2800, 0.2800, 0.5800, 0.5200, 0.2800, 0.2800, 0.2800, 0.2200, 0.4800,
          0.3000, 0.3900, 0.1800, 0.3000, 0.2800, 0.4000, 0.2800, 0.4000, 0.2800, 0.2800,
          0.2800, 0.2800, 0.2800, 0.2200, 0.4800, 0.3000, 0.3000, 0.2800, 0.2800, 0.2800,
          0.2800, 0.3100, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800, 0.2800],
    "Y": [0.3100, 0.3900, 0.3100, 0.3100, 0.3100, 0.3000, 0.5200, 0.4700, 0.1700, 0.2400,
          0.4500, 0.3100, 0.3900, 0.3900, 0.3000, 0.5200, 0.4700, 0.1700, 0.3000, 0.1700,
          0.2400, 0.4900, 0.1500, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3000,
          0.2600, 0.2400, 0.3600, 0.5200, 0.5200, 0.4200, 0.2800, 0.1500, 0.3500, 0.3100,
          0.3100, 0.3100, 0.3100, 0.2800, 0.3100, 0.3100, 0.3100, 0.2400, 0.3000, 0.5200,
          0.2800, 0.1500, 0.1700, 0.3100, 0.4900, 0.3100, 0.4900, 0.3100, 0.3100, 0.3100,
          0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100,
          0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100, 0.3100],
    "LUMINANCE": [31.500, 19.600, 0.000, 17.500, 31.500, 17.500, 42.000, 49.000, 14.000, 33.600,
                  21.000, 56.000, 19.600, 19.600, 17.500, 42.000, 49.000, 14.000, 17.500, 14.000,
                  33.600, 34.300, 10.500, 7.000, 17.500, 0.000, 7.000, 17.500, 56.000, 45.500,
                  38.500, 31.500, 28.000, 42.000, 14.000, 21.000, 19.600, 15.400, 24.500, 17.500,
                  0.000, 0.000, 17.500, 0.000, 0.000, 17.500, 31.500, 31.500, 31.500, 31.500]
}


print(len(data['Token']))
print(len(data['Colour']))
print(len(data['X']))
print(len(data['Y']))
print(len(data['LUMINANCE']))
# 创建DataFrame
df = pd.DataFrame(data)

# 将数据写入Excel文件


# 创建DataFrame


# 将数据写入Excel文件
df.to_excel("color_data.xlsx", index=False)
